app/Http/Controllers/ProductController.php

    public function index()
    {
//        $products = Product::all();

//        dd($products);

        return view('products.index')->with([
            'products' => Product::all(),
        ]);
---
select * from `products`